Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/sqi.h
/*
 * Component description for SQI
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-11-16T06:44:02Z */
#ifndef _PIC32CKSG01_SQI_COMPONENT_H_
#define _PIC32CKSG01_SQI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SQI                                          */
/* ************************************************************************** */

/* -------- SQI_BDCTRL : (SQI Offset: 0x00) (R/W 32) Buffer Descriptor Control Register -------- */
#define SQI_BDCTRL_BD_BUFLEN_Pos              _UINT32_(0)                                          /* (SQI_BDCTRL) Buffer Descriptor Length Position */
#define SQI_BDCTRL_BD_BUFLEN_Msk              (_UINT32_(0x1FF) << SQI_BDCTRL_BD_BUFLEN_Pos)        /* (SQI_BDCTRL) Buffer Descriptor Length Mask */
#define SQI_BDCTRL_BD_BUFLEN(value)           (SQI_BDCTRL_BD_BUFLEN_Msk & (_UINT32_(value) << SQI_BDCTRL_BD_BUFLEN_Pos)) /* Assigment of value for BD_BUFLEN in the SQI_BDCTRL register */
#define SQI_BDCTRL_CBD_INT_EN_Pos             _UINT32_(16)                                         /* (SQI_BDCTRL) Generate Interrupt after processing the current buffer descriptor Position */
#define SQI_BDCTRL_CBD_INT_EN_Msk             (_UINT32_(0x1) << SQI_BDCTRL_CBD_INT_EN_Pos)         /* (SQI_BDCTRL) Generate Interrupt after processing the current buffer descriptor Mask */
#define SQI_BDCTRL_CBD_INT_EN(value)          (SQI_BDCTRL_CBD_INT_EN_Msk & (_UINT32_(value) << SQI_BDCTRL_CBD_INT_EN_Pos)) /* Assigment of value for CBD_INT_EN in the SQI_BDCTRL register */
#define SQI_BDCTRL_PKT_INT_EN_Pos             _UINT32_(17)                                         /* (SQI_BDCTRL) Generate Interrupt after processing the current buffer descriptor, if it is the end of the packet. Position */
#define SQI_BDCTRL_PKT_INT_EN_Msk             (_UINT32_(0x1) << SQI_BDCTRL_PKT_INT_EN_Pos)         /* (SQI_BDCTRL) Generate Interrupt after processing the current buffer descriptor, if it is the end of the packet. Mask */
#define SQI_BDCTRL_PKT_INT_EN(value)          (SQI_BDCTRL_PKT_INT_EN_Msk & (_UINT32_(value) << SQI_BDCTRL_PKT_INT_EN_Pos)) /* Assigment of value for PKT_INT_EN in the SQI_BDCTRL register */
#define SQI_BDCTRL_LIFM_Pos                   _UINT32_(18)                                         /* (SQI_BDCTRL) Indicates last data of the packet. Position */
#define SQI_BDCTRL_LIFM_Msk                   (_UINT32_(0x1) << SQI_BDCTRL_LIFM_Pos)               /* (SQI_BDCTRL) Indicates last data of the packet. Mask */
#define SQI_BDCTRL_LIFM(value)                (SQI_BDCTRL_LIFM_Msk & (_UINT32_(value) << SQI_BDCTRL_LIFM_Pos)) /* Assigment of value for LIFM in the SQI_BDCTRL register */
#define SQI_BDCTRL_LAST_BD_Pos                _UINT32_(19)                                         /* (SQI_BDCTRL) Last Buffer Descriptors. Position */
#define SQI_BDCTRL_LAST_BD_Msk                (_UINT32_(0x1) << SQI_BDCTRL_LAST_BD_Pos)            /* (SQI_BDCTRL) Last Buffer Descriptors. Mask */
#define SQI_BDCTRL_LAST_BD(value)             (SQI_BDCTRL_LAST_BD_Msk & (_UINT32_(value) << SQI_BDCTRL_LAST_BD_Pos)) /* Assigment of value for LAST_BD in the SQI_BDCTRL register */
#define SQI_BDCTRL_DIR_Pos                    _UINT32_(20)                                         /* (SQI_BDCTRL) Direction of data transfer. Position */
#define SQI_BDCTRL_DIR_Msk                    (_UINT32_(0x1) << SQI_BDCTRL_DIR_Pos)                /* (SQI_BDCTRL) Direction of data transfer. Mask */
#define SQI_BDCTRL_DIR(value)                 (SQI_BDCTRL_DIR_Msk & (_UINT32_(value) << SQI_BDCTRL_DIR_Pos)) /* Assigment of value for DIR in the SQI_BDCTRL register */
#define SQI_BDCTRL_SDR_DDR_Pos                _UINT32_(21)                                         /* (SQI_BDCTRL) SDR or DDR mode Position */
#define SQI_BDCTRL_SDR_DDR_Msk                (_UINT32_(0x1) << SQI_BDCTRL_SDR_DDR_Pos)            /* (SQI_BDCTRL) SDR or DDR mode Mask */
#define SQI_BDCTRL_SDR_DDR(value)             (SQI_BDCTRL_SDR_DDR_Msk & (_UINT32_(value) << SQI_BDCTRL_SDR_DDR_Pos)) /* Assigment of value for SDR_DDR in the SQI_BDCTRL register */
#define SQI_BDCTRL_MODE_Pos                   _UINT32_(22)                                         /* (SQI_BDCTRL) Based on the mode, the controller has to transmit or receive the data in one or two or 4 lanes Position */
#define SQI_BDCTRL_MODE_Msk                   (_UINT32_(0x3) << SQI_BDCTRL_MODE_Pos)               /* (SQI_BDCTRL) Based on the mode, the controller has to transmit or receive the data in one or two or 4 lanes Mask */
#define SQI_BDCTRL_MODE(value)                (SQI_BDCTRL_MODE_Msk & (_UINT32_(value) << SQI_BDCTRL_MODE_Pos)) /* Assigment of value for MODE in the SQI_BDCTRL register */
#define SQI_BDCTRL_SPI_DEV_SEL2_Pos           _UINT32_(24)                                         /* (SQI_BDCTRL) SPI Device Select bit 2 Position */
#define SQI_BDCTRL_SPI_DEV_SEL2_Msk           (_UINT32_(0x1) << SQI_BDCTRL_SPI_DEV_SEL2_Pos)       /* (SQI_BDCTRL) SPI Device Select bit 2 Mask */
#define SQI_BDCTRL_SPI_DEV_SEL2(value)        (SQI_BDCTRL_SPI_DEV_SEL2_Msk & (_UINT32_(value) << SQI_BDCTRL_SPI_DEV_SEL2_Pos)) /* Assigment of value for SPI_DEV_SEL2 in the SQI_BDCTRL register */
#define SQI_BDCTRL_LSBF_Pos                   _UINT32_(25)                                         /* (SQI_BDCTRL) Data format on SPI Data Lanes Position */
#define SQI_BDCTRL_LSBF_Msk                   (_UINT32_(0x1) << SQI_BDCTRL_LSBF_Pos)               /* (SQI_BDCTRL) Data format on SPI Data Lanes Mask */
#define SQI_BDCTRL_LSBF(value)                (SQI_BDCTRL_LSBF_Msk & (_UINT32_(value) << SQI_BDCTRL_LSBF_Pos)) /* Assigment of value for LSBF in the SQI_BDCTRL register */
#define SQI_BDCTRL_STAT_CHECK_Pos             _UINT32_(27)                                         /* (SQI_BDCTRL) Status Check Position */
#define SQI_BDCTRL_STAT_CHECK_Msk             (_UINT32_(0x1) << SQI_BDCTRL_STAT_CHECK_Pos)         /* (SQI_BDCTRL) Status Check Mask */
#define SQI_BDCTRL_STAT_CHECK(value)          (SQI_BDCTRL_STAT_CHECK_Msk & (_UINT32_(value) << SQI_BDCTRL_STAT_CHECK_Pos)) /* Assigment of value for STAT_CHECK in the SQI_BDCTRL register */
#define SQI_BDCTRL_SPI_DEV_SEL10_Pos          _UINT32_(28)                                         /* (SQI_BDCTRL) SPI Device Select bits 1:0 Position */
#define SQI_BDCTRL_SPI_DEV_SEL10_Msk          (_UINT32_(0x3) << SQI_BDCTRL_SPI_DEV_SEL10_Pos)      /* (SQI_BDCTRL) SPI Device Select bits 1:0 Mask */
#define SQI_BDCTRL_SPI_DEV_SEL10(value)       (SQI_BDCTRL_SPI_DEV_SEL10_Msk & (_UINT32_(value) << SQI_BDCTRL_SPI_DEV_SEL10_Pos)) /* Assigment of value for SPI_DEV_SEL10 in the SQI_BDCTRL register */
#define SQI_BDCTRL_CS_ASSERT_Pos              _UINT32_(30)                                         /* (SQI_BDCTRL) Chip Select Assert/Deassert Position */
#define SQI_BDCTRL_CS_ASSERT_Msk              (_UINT32_(0x1) << SQI_BDCTRL_CS_ASSERT_Pos)          /* (SQI_BDCTRL) Chip Select Assert/Deassert Mask */
#define SQI_BDCTRL_CS_ASSERT(value)           (SQI_BDCTRL_CS_ASSERT_Msk & (_UINT32_(value) << SQI_BDCTRL_CS_ASSERT_Pos)) /* Assigment of value for CS_ASSERT in the SQI_BDCTRL register */
#define SQI_BDCTRL_DESC_EN_Pos                _UINT32_(31)                                         /* (SQI_BDCTRL) Descriptor Enable Position */
#define SQI_BDCTRL_DESC_EN_Msk                (_UINT32_(0x1) << SQI_BDCTRL_DESC_EN_Pos)            /* (SQI_BDCTRL) Descriptor Enable Mask */
#define SQI_BDCTRL_DESC_EN(value)             (SQI_BDCTRL_DESC_EN_Msk & (_UINT32_(value) << SQI_BDCTRL_DESC_EN_Pos)) /* Assigment of value for DESC_EN in the SQI_BDCTRL register */
#define SQI_BDCTRL_Msk                        _UINT32_(0xFBFF01FF)                                 /* (SQI_BDCTRL) Register Mask  */

#define SQI_BDCTRL_SPI_DEV_SEL_Pos            _UINT32_(24)                                         /* (SQI_BDCTRL Position) SPI Device Select bit 2 */
#define SQI_BDCTRL_SPI_DEV_SEL_Msk            (_UINT32_(0x1) << SQI_BDCTRL_SPI_DEV_SEL_Pos)        /* (SQI_BDCTRL Mask) SPI_DEV_SEL */
#define SQI_BDCTRL_SPI_DEV_SEL(value)         (SQI_BDCTRL_SPI_DEV_SEL_Msk & (_UINT32_(value) << SQI_BDCTRL_SPI_DEV_SEL_Pos)) 

/* -------- SQI_BDSTATUS : (SQI Offset: 0x04) (R/W 32) Buffer Descriptor Status Register -------- */
#define SQI_BDSTATUS_Msk                      _UINT32_(0x00000000)                                 /* (SQI_BDSTATUS) Register Mask  */


/* -------- SQI_BDADDR : (SQI Offset: 0x08) (R/W 32) Buffer Descriptor Address Register -------- */
#define SQI_BDADDR_Msk                        _UINT32_(0x00000000)                                 /* (SQI_BDADDR) Register Mask  */


/* -------- SQI_BDNXTPTR : (SQI Offset: 0x0C) (R/W 32) Buffer Descriptor Next Pointer Register -------- */
#define SQI_BDNXTPTR_Msk                      _UINT32_(0x00000000)                                 /* (SQI_BDNXTPTR) Register Mask  */


/* -------- SQI_CTRLA : (SQI Offset: 0x00) (R/W 32) Control A register -------- */
#define SQI_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_CTRLA) Control A register  Reset Value */

