Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/sqi.h
#define SQI_TAPCON_CLKOUTDLY_Pos              _UINT32_(0)                                          /* (SQI_TAPCON) Used to add delay on spi clock output.16 taps available. Position */
#define SQI_TAPCON_CLKOUTDLY_Msk              (_UINT32_(0xF) << SQI_TAPCON_CLKOUTDLY_Pos)          /* (SQI_TAPCON) Used to add delay on spi clock output.16 taps available. Mask */
#define SQI_TAPCON_CLKOUTDLY(value)           (SQI_TAPCON_CLKOUTDLY_Msk & (_UINT32_(value) << SQI_TAPCON_CLKOUTDLY_Pos)) /* Assigment of value for CLKOUTDLY in the SQI_TAPCON register */
#define SQI_TAPCON_DATAOUTDLY_Pos             _UINT32_(4)                                          /* (SQI_TAPCON) Used to add delay on spi data outputs (1/2/4lanes). 16 taps available. Position */
#define SQI_TAPCON_DATAOUTDLY_Msk             (_UINT32_(0xF) << SQI_TAPCON_DATAOUTDLY_Pos)         /* (SQI_TAPCON) Used to add delay on spi data outputs (1/2/4lanes). 16 taps available. Mask */
#define SQI_TAPCON_DATAOUTDLY(value)          (SQI_TAPCON_DATAOUTDLY_Msk & (_UINT32_(value) << SQI_TAPCON_DATAOUTDLY_Pos)) /* Assigment of value for DATAOUTDLY in the SQI_TAPCON register */
#define SQI_TAPCON_SDRCLKINDLY_Pos            _UINT32_(8)                                          /* (SQI_TAPCON) Used only in SDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values  (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT). Position */
#define SQI_TAPCON_SDRCLKINDLY_Msk            (_UINT32_(0x3F) << SQI_TAPCON_SDRCLKINDLY_Pos)       /* (SQI_TAPCON) Used only in SDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values  (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT). Mask */
#define SQI_TAPCON_SDRCLKINDLY(value)         (SQI_TAPCON_SDRCLKINDLY_Msk & (_UINT32_(value) << SQI_TAPCON_SDRCLKINDLY_Pos)) /* Assigment of value for SDRCLKINDLY in the SQI_TAPCON register */
#define SQI_TAPCON_DDRDATINDLY_Pos            _UINT32_(16)                                         /* (SQI_TAPCON) Used only in DDR mode. This field is used to add tap delay cells on the data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT). Position */
#define SQI_TAPCON_DDRDATINDLY_Msk            (_UINT32_(0xF) << SQI_TAPCON_DDRDATINDLY_Pos)        /* (SQI_TAPCON) Used only in DDR mode. This field is used to add tap delay cells on the data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT). Mask */
#define SQI_TAPCON_DDRDATINDLY(value)         (SQI_TAPCON_DDRDATINDLY_Msk & (_UINT32_(value) << SQI_TAPCON_DDRDATINDLY_Pos)) /* Assigment of value for DDRDATINDLY in the SQI_TAPCON register */
#define SQI_TAPCON_SDRDATINDLY_Pos            _UINT32_(20)                                         /* (SQI_TAPCON) Used only in SDR mode. This field is used to add tap delay cells on the Data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT). Position */
#define SQI_TAPCON_SDRDATINDLY_Msk            (_UINT32_(0xF) << SQI_TAPCON_SDRDATINDLY_Pos)        /* (SQI_TAPCON) Used only in SDR mode. This field is used to add tap delay cells on the Data input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (DATA_IN_ALT_DLY_CNT Vs DATA_IN_DLY_CNT). Mask */
#define SQI_TAPCON_SDRDATINDLY(value)         (SQI_TAPCON_SDRDATINDLY_Msk & (_UINT32_(value) << SQI_TAPCON_SDRDATINDLY_Pos)) /* Assigment of value for SDRDATINDLY in the SQI_TAPCON register */
#define SQI_TAPCON_DDRCLKINDLY_Pos            _UINT32_(24)                                         /* (SQI_TAPCON) Used only in DDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT). Position */
#define SQI_TAPCON_DDRCLKINDLY_Msk            (_UINT32_(0x3F) << SQI_TAPCON_DDRCLKINDLY_Pos)       /* (SQI_TAPCON) Used only in DDR mode. This field is used to add tap delay cells on the spi clock input. Based on the mode of operation (SDR Vs DDR), the controller dynamically picks the appropriate delay values (CLK_IN_DLY_CNT Vs CLK_IN_ALT_DLY_CNT). Mask */
#define SQI_TAPCON_DDRCLKINDLY(value)         (SQI_TAPCON_DDRCLKINDLY_Msk & (_UINT32_(value) << SQI_TAPCON_DDRCLKINDLY_Pos)) /* Assigment of value for DDRCLKINDLY in the SQI_TAPCON register */
#define SQI_TAPCON_Msk                        _UINT32_(0x3FFF3FFF)                                 /* (SQI_TAPCON) Register Mask  */


/* -------- SQI_MEMSTAT : (SQI Offset: 0x160) (R/W 32) SPI Status Control Register -------- */
#define SQI_MEMSTAT_RESETVALUE                _UINT32_(0x10005)                                    /*  (SQI_MEMSTAT) SPI Status Control Register  Reset Value */

#define SQI_MEMSTAT_STATCMD_Pos               _UINT32_(0)                                          /* (SQI_MEMSTAT) Status Data: The first byte to be sent must be in LSB. For example if the user wants to send 0F first and 0C second, then we should program 16?h0C0F. Position */
#define SQI_MEMSTAT_STATCMD_Msk               (_UINT32_(0xFFFF) << SQI_MEMSTAT_STATCMD_Pos)        /* (SQI_MEMSTAT) Status Data: The first byte to be sent must be in LSB. For example if the user wants to send 0F first and 0C second, then we should program 16?h0C0F. Mask */
#define SQI_MEMSTAT_STATCMD(value)            (SQI_MEMSTAT_STATCMD_Msk & (_UINT32_(value) << SQI_MEMSTAT_STATCMD_Pos)) /* Assigment of value for STATCMD in the SQI_MEMSTAT register */
#define SQI_MEMSTAT_STATBYTES_Pos             _UINT32_(16)                                         /* (SQI_MEMSTAT) No. of bytes to send: 00 - Reserved ,01 - 1 byte ,10 - 2 bytes ,11 - Reserved Position */
#define SQI_MEMSTAT_STATBYTES_Msk             (_UINT32_(0x3) << SQI_MEMSTAT_STATBYTES_Pos)         /* (SQI_MEMSTAT) No. of bytes to send: 00 - Reserved ,01 - 1 byte ,10 - 2 bytes ,11 - Reserved Mask */
#define SQI_MEMSTAT_STATBYTES(value)          (SQI_MEMSTAT_STATBYTES_Msk & (_UINT32_(value) << SQI_MEMSTAT_STATBYTES_Pos)) /* Assigment of value for STATBYTES in the SQI_MEMSTAT register */
#define SQI_MEMSTAT_TYPESTAT_Pos              _UINT32_(18)                                         /* (SQI_MEMSTAT) Status Lane: Indicates the number of lanes (single/dual/quad) in which the Status command/ Read Status Register value is transmitted to /received from flash. 2?b00 - single lane, 2?b01 - dual lane, 2?b10 - quad lane Position */
#define SQI_MEMSTAT_TYPESTAT_Msk              (_UINT32_(0x3) << SQI_MEMSTAT_TYPESTAT_Pos)          /* (SQI_MEMSTAT) Status Lane: Indicates the number of lanes (single/dual/quad) in which the Status command/ Read Status Register value is transmitted to /received from flash. 2?b00 - single lane, 2?b01 - dual lane, 2?b10 - quad lane Mask */
#define SQI_MEMSTAT_TYPESTAT(value)           (SQI_MEMSTAT_TYPESTAT_Msk & (_UINT32_(value) << SQI_MEMSTAT_TYPESTAT_Pos)) /* Assigment of value for TYPESTAT in the SQI_MEMSTAT register */
#define SQI_MEMSTAT_STATPOS_Pos               _UINT32_(20)                                         /* (SQI_MEMSTAT) Indicates whether the BUSY bit position in Status Register of flash is 0 or 7. 1?b0 - 0th bit position (bit 0 is valid for busy status), 1?b1 - 7th bit position (bit7 is valid for busy status) The Controller continuously reads the Status register value from flash until this bit which indicates the flash busy status goes low. Position */
#define SQI_MEMSTAT_STATPOS_Msk               (_UINT32_(0x1) << SQI_MEMSTAT_STATPOS_Pos)           /* (SQI_MEMSTAT) Indicates whether the BUSY bit position in Status Register of flash is 0 or 7. 1?b0 - 0th bit position (bit 0 is valid for busy status), 1?b1 - 7th bit position (bit7 is valid for busy status) The Controller continuously reads the Status register value from flash until this bit which indicates the flash busy status goes low. Mask */
#define SQI_MEMSTAT_STATPOS(value)            (SQI_MEMSTAT_STATPOS_Msk & (_UINT32_(value) << SQI_MEMSTAT_STATPOS_Pos)) /* Assigment of value for STATPOS in the SQI_MEMSTAT register */
#define SQI_MEMSTAT_Msk                       _UINT32_(0x001FFFFF)                                 /* (SQI_MEMSTAT) Register Mask  */


/* -------- SQI_XCON3 : (SQI Offset: 0x164) (R/W 32) SPI XIP Control 3 Register -------- */
#define SQI_XCON3_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_XCON3) SPI XIP Control 3 Register  Reset Value */

